
&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыВыбораНоменклатуры = Новый Структура("ДокументСсылка,Склад",Объект.Ссылка,Объект.Склад); 
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораПоСкладу", ПараметрыВыбораНоменклатуры, Элементы.СписокНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Если  ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.СписокНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ЭлементМассива.Номенклатура;  
			НоваяСтрока.Количество = ЭлементМассива.Количество;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	стр = Элементы.СписокНоменклатуры.ТекущиеДанные;
	стр.сумма = стр.количество*стр.цена;
КонецПроцедуры
