
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановкаВидимостиМенеджера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УстановкаВидимостиМенеджера();
	
КонецПроцедуры


&НаСервере
Процедура УстановкаВидимостиМенеджера()

	ПараметрыФункциональныхОпций = Новый Структура();
	ПараметрыФункциональныхОпций.Вставить("Пользователь", ОбщийМодуль.ПолучитьТекущегоПользователя());
	ПараметрыФункциональныхОпций.Вставить("Период", НачалоДня(Объект.Дата));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);

КонецПроцедуры // УстановкаВидимостиМенеджера() 
