&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Список.Параметры.УстановитьЗначениеПараметра("Склад", Параметры.Склад);
	Если ЗначениеЗаполнено(Параметры.ДокументСсылка) Тогда
	    ВременнойМомент=Параметры.ДокументСсылка.МоментВремени();
	Иначе
		ВременнойМомент=Неопределено;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаСреза", ВременнойМомент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОтобратьНоменклатуру(Значение);

КонецПроцедуры

&НаКлиенте                                              
Процедура ОтобранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ОтобратьНоменклатуру(ПараметрыПеретаскивания.Значение);

КонецПроцедуры

&НаКлиенте
Процедура ОтобратьНоменклатуру(ВыбраннаяНоменклатура)
	
	ПараметрыОтбора = Новый Структура("Номенклатура", ВыбраннаяНоменклатура);
	МассивСтрок = ОтобранныеТовары.НайтиСтроки(ПараметрыОтбора);
	Если МассивСтрок.Количество()>0 Тогда
		Индекс = ОтобранныеТовары.Индекс(МассивСтрок[0]);
		НайденнаяСтрока = ОтобранныеТовары.Получить(Индекс);
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
	Иначе
		НоваяСтрока = ОтобранныеТовары.Добавить();     
		НоваяСтрока.Номенклатура = ВыбраннаяНоменклатура;
		НоваяСтрока.Количество = 1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте                                                      
Процедура ОтобранныеТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
	
	МассивВозврата = Новый Массив;
	Для Каждого Строка Из ОтобранныеТовары Цикл
		СтруктураВозврата = Новый Структура("Номенклатура,Количество", Строка.Номенклатура, Строка.Количество);
		МассивВозврата.Добавить(СтруктураВозврата)
	КонецЦикла;
	ОповеститьОВыборе(МассивВозврата);
	
КонецПроцедуры
